hummelrally/esp32-isotp-ble-bridge/sdkconfig.defaults
# sdkconfig.defaults for ESP32-C3 Super Mini
  # After cloning, run: idf.py set-target esp32c3
    # This will regenerate sdkconfig with C3-specific settings.
    # The settings below override defaults for this project.

    # Target chip
    CONFIG_IDF_TARGET="esp32c3"

    # Bluetooth - Use Bluedroid (same as original) for API compatibility
    CONFIG_BT_ENABLED=y
    CONFIG_BT_BLUEDROID_ENABLED=y
    CONFIG_BT_NIMBLE_ENABLED=n
    CONFIG_BT_BLE_ENABLED=y
    CONFIG_BT_GATTS_ENABLE=y
    CONFIG_BT_GATTC_ENABLE=y
    CONFIG_BT_BLE_SMP_ENABLE=y
    CONFIG_BT_STACK_NO_LOG=y
    CONFIG_BT_ACL_CONNECTIONS=4

    # BLE controller (ESP32-C3 uses CONFIG_BT_CTRL_* not CONFIG_BTDM_*)
    CONFIG_BT_CTRL_MODE_EFF=1
    CONFIG_BT_CTRL_BLE_MAX_ACT=10
    CONFIG_BT_CTRL_BLE_MAX_ACT_EFF=10

    # CPU frequency - C3 max is 160 MHz
    CONFIG_ESP32C3_DEFAULT_CPU_FREQ_160=y
    CONFIG_ESP32C3_DEFAULT_CPU_FREQ_MHZ=160

    # Flash config (4MB on C3 Super Mini)
    CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
    CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

    # Flash mode - use QIO for C3
    CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
    CONFIG_ESPTOOLPY_FLASHMODE="dio"

    # Flash frequency
    CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
    CONFIG_ESPTOOLPY_FLASHFREQ="80m"

    # Serial monitor baud rate
    CONFIG_ESPTOOLPY_MONITOR_BAUD_OTHER=y
    CONFIG_ESPTOOLPY_MONITOR_BAUD_OTHER_VAL=250000
    CONFIG_ESPTOOLPY_MONITOR_BAUD=250000

    # Bootloader offset for C3 is 0x0 (not 0x1000 like ESP32)
    CONFIG_BOOTLOADER_OFFSET_IN_FLASH=0x0

    # Log level - none for production
    CONFIG_LOG_DEFAULT_LEVEL_NONE=y
    CONFIG_LOG_DEFAULT_LEVEL=0
    CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
    CONFIG_LOG_MAXIMUM_LEVEL=0

    # Power management
    CONFIG_PM_ENABLE=y

    # FreeRTOS - C3 is unicore
    CONFIG_FREERTOS_UNICORE=y
    CONFIG_FREERTOS_HZ=250

    # TWAI (CAN bus)
    # CONFIG_TWAI_ISR_IN_IRAM is not set

    # Compiler optimization
    CONFIG_COMPILER_OPTIMIZATION_PERF=y

    # WDT
    CONFIG_ESP_TASK_WDT=y
    CONFIG_ESP_TASK_WDT_TIMEOUT_S=5

    # Console UART
    CONFIG_ESP_CONSOLE_UART_NUM=0
    CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

    # Main task stack
    CONFIG_ESP_MAIN_TASK_STACK_SIZE=3584

    # NVS
    # (no special settings needed)

    # Partition table
    CONFIG_PARTITION_TABLE_SINGLE_APP=y
    CONFIG_PARTITION_TABLE_OFFSET=0x8000
    
